###  Домашнее задание «Библиотека Pandas»

Задание 1 Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv('movies.csv')

In [3]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
mov_title = movies[['movieId', 'title']]
mov_title

       movieId                               title
0            1                    Toy Story (1995)
1            2                      Jumanji (1995)
2            3             Grumpier Old Men (1995)
3            4            Waiting to Exhale (1995)
4            5  Father of the Bride Part II (1995)
...        ...                                 ...
62418   209157                           We (2018)
62419   209159           Window of the Soul (2001)
62420   209163                    Bad Poems (2018)
62421   209169                 A Girl Thing (2001)
62422   209171      Women of Devil's Island (1962)

[62423 rows x 2 columns]

In [5]:
ratings = pd.read_csv('ratings.csv')

In [6]:
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [7]:
mov_rating = ratings[['movieId', 'rating']]

In [14]:
rating_movies = mov_rating.merge(mov_title, on = 'movieId', how = 'left')

In [19]:
rating_movies.head()

   movieId  rating                                             title
0      296     5.0                               Pulp Fiction (1994)
1      306     3.5  Three Colors: Red (Trois couleurs: Rouge) (1994)
2      307     5.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)
3      665     5.0                                Underground (1995)
4      899     3.5                        Singin' in the Rain (1952)

In [26]:
sort = rating_movies.sort_values(['rating'], ascending = False).head()

In [43]:
max_rating = mov_rating['rating'].max()

In [46]:
filter_rating_movies = rating_movies[(rating_movies['rating'] == max_rating)]

In [47]:
movies50 = filter_rating_movies.groupby(['movieId', 'title'])['movieId'].count()

In [48]:
movies50

movieId  title
1        Toy Story (1995)                      13506
2        Jumanji (1995)                         1887
3        Grumpier Old Men (1995)                1039
4        Waiting to Exhale (1995)                171
5        Father of the Bride Part II (1995)      840
                                               ...
208800   Lady and the Tramp (2019)                 1
208859   Screen Play (1992)                        1
208939   Klaus (2019)                              3
209085   The Mistletoe Secret (2019)               1
209155   Santosh Subramaniam (2008)                1
Name: movieId, Length: 27133, dtype: int64

In [49]:
movies50.sort_values(ascending = False).head()

movieId  title
318      Shawshank Redemption, The (1994)             39553
296      Pulp Fiction (1994)                          32169
356      Forrest Gump (1994)                          25918
260      Star Wars: Episode IV - A New Hope (1977)    25804
2571     Matrix, The (1999)                           25482
Name: movieId, dtype: int64

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [158]:
power = pd.read_csv('power.csv')

In [159]:
power.head(10)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1
7  Belgium  2009      45.0         1
8  Czechia  1998       1.0         1
9  Czechia  1995       7.0         1

In [160]:
power_countries = power[ (power['country']=='Latvia') | (power['country']=='Lithuania')| (power['country']=='Estonia') ]

power_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [161]:
power_countries_cat = power_countries[ (power_countries['category']== 4 ) | (power_countries['category']== 12 ) | (power_countries['category']== 21) ]
power_countries_cat.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [168]:
power_countries_cat_year = power_countries_cat[ (power_countries_cat['year'] >= 2005) & (power_countries_cat['year'] <=2010) ]
power_countries_cat_year.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [170]:
power_countries_cat_year_q = power_countries_cat_year[ (power_countries_cat_year['quantity'] >= 0.0)]
power_countries_cat_year_q.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [171]:
power_countries_cat_year_q['quantity'].unique()

array([1.000e+00, 0.000e+00, 3.000e+00, 6.000e+00, 5.000e+00, 5.000e+01,
       6.200e+01, 5.500e+01, 5.700e+01, 9.000e+01, 2.000e+00, 7.900e+01,
       5.300e+01, 6.300e+01, 7.400e+01, 9.000e+00, 3.000e+01, 1.650e+02,
       2.040e+02, 8.000e+00, 1.610e+02, 1.990e+02, 1.420e+02, 1.090e+02,
       1.210e+02, 1.800e+01, 1.600e+01, 1.510e+02, 1.390e+02, 2.860e+02,
       3.690e+02, 1.440e+02, 1.130e+02, 3.510e+02, 3.610e+02, 1.560e+02,
       1.410e+02, 2.920e+02, 3.780e+02, 4.000e+00, 2.500e+01, 7.600e+02,
       2.616e+03, 2.537e+03, 2.584e+03, 2.544e+03, 2.495e+03, 2.492e+03,
       9.510e+02, 9.370e+02, 5.750e+02, 5.580e+02, 5.620e+02, 5.760e+02,
       2.536e+03, 2.532e+03, 2.330e+03, 2.292e+03, 2.435e+03, 2.433e+03,
       7.000e+00, 1.576e+03, 1.536e+03, 1.531e+03, 1.530e+03, 8.760e+02,
       8.750e+02, 8.770e+02, 1.183e+03, 1.070e+02, 1.030e+02, 7.600e+01,
       4.900e+01, 2.900e+01, 2.600e+01, 1.330e+02, 9.800e+01, 5.400e+01,
       4.700e+01, 3.100e+01, 2.100e+01, 1.700e+01, 2.800e+01, 1.300e+01,
       2.700e+01, 1.980e+02, 1.950e+02, 1.880e+02, 1.910e+02, 3.600e+01,
       2.200e+01, 3.200e+01, 2.300e+01, 2.400e+01, 3.400e+01, 2.230e+02,
       2.200e+02, 2.130e+02, 2.160e+02, 6.100e+01, 2.637e+03, 2.554e+03,
       2.612e+03, 2.572e+03, 2.521e+03, 2.523e+03, 9.670e+02, 9.530e+02,
       5.910e+02, 5.710e+02, 5.880e+02, 6.030e+02, 2.734e+03, 2.727e+03,
       2.518e+03, 2.483e+03, 2.471e+03, 1.581e+03, 1.541e+03, 2.729e+03,
       2.647e+03, 2.665e+03, 2.598e+03, 2.530e+03, 2.527e+03, 2.557e+03,
       2.502e+03, 2.132e+03, 2.115e+03, 2.119e+03, 3.545e+03, 4.689e+03,
       4.442e+03, 4.397e+03, 4.526e+03, 4.494e+03, 2.751e+03, 2.694e+03,
       2.627e+03, 2.559e+03, 2.580e+03, 2.526e+03, 2.155e+03, 2.133e+03,
       2.151e+03, 2.166e+03, 3.768e+03, 4.909e+03, 4.655e+03, 4.613e+03,
       4.587e+03, 4.556e+03, 1.080e+02, 1.040e+02, 7.700e+01])

In [172]:
sum_ = power_countries_cat_year_q['quantity'].sum()
sum_

240580.0

In [180]:
print('Cуммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года составляет:', sum_)

Cуммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года составляет: 240580.0

Фильтрую по странам прибалтики: Lатвия, Lитва, Eстония

In [133]:
powerLLE = power.loc[(power['country'] == 'Latvia') | (power['country'] == 'Estonia') | (power['country'] == 'Lithuania')  ]

In [134]:
powerLLE.head(500)

         country  year  quantity  category
373    Lithuania  2014      39.0         1
374    Lithuania  2013     192.0         1
375    Lithuania  2012     196.0         1
376    Lithuania  2011     171.0         1
377    Lithuania  2010     158.0         1
...          ...   ...       ...       ...
43231     Latvia  2013      17.0         6
43232     Latvia  2012      17.0         6
43233     Latvia  2011      19.0         6
43234     Latvia  2010      21.0         6
43235     Latvia  2009       2.0         6

[500 rows x 4 columns]

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [179]:
df = pd.read_html('https://fortrader.org/quotes')[2]
df.head()

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 880      35.00          2.00        NaN
1  Серебро Цена на серебро на бирже  27.56       0.16          0.58        NaN
2         Палладий Цена на Палладий  2 775    -116.00         -4.00        NaN
3           Платина Цены на платину  1 169     -62.00         -5.00        NaN
4           Медь Цена меди на бирже   4.51      -0.16         -3.33        NaN